In [14]:
import pandas as pd
import numpy as np
from __future__ import print_function
# Importar datos desde un archivo existente

datos = pd.read_xls("https://ibm.box.com/shared/statics/lw190pt9zpy5bd1ptyg2aw15awomz9pu.xlsx", sheetname="Canada by Citizenship", skiprows=range(20), skip_footer = 2)
datos.head(5)

AttributeError: module 'pandas' has no attribute 'read_xls'

In [12]:
# Reemplazar datos de la cadecera

headers = ["ID", "Modelo", "Locacion", "Año", "Kilometros_Recorridos", "Tipo_Combustible", "Transmision", "Dueños", "Millas_Recorridas", "Cilindraje", "Potencia", "Asientos", "Nuevo_Precio"]
datos.columns =headers
datos.head(5)

,ID,Modelo,Locacion,Año,Kilometros_Recorridos,Tipo_Combustible,Transmision,Dueños,Millas_Recorridas,Cilindraje,Potencia,Asientos,Nuevo_Precio
0,0,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26 km/kg,998 CC,58.2 bhp,4.0,NaN
1,1,Maruti Alto 800 2016-2019 LXI,Coimbatore,2013,54493,Petrol,Manual,Second,24.7 kmpl,796 CC,47.3 bhp,5.0,NaN
2,2,Toyota Innova Crysta Touring Sport 2.4 MT,Mumbai,2017,34000,Diesel,Manual,First,13.68 kmpl,2393 CC,147.8 bhp,7.0,25.27 Lakh
3,3,Toyota Etios Liva GD,Hyderabad,2012,139000,Diesel,Manual,First,23.59 kmpl,1364 CC,null bhp,5.0,NaN
4,4,Hyundai i20 Magna,Mumbai,2014,29000,Petrol,Manual,First,18.5 kmpl,1197 CC,82.85 bhp,5.0,NaN

In [4]:
datos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1234 entries, 0 to 1233
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID                     1234 non-null   int64
 1   Modelo                 1234 non-null   object
 2   Locacion               1234 non-null   object
 3   Año                    1234 non-null   int64
 4   Kilometros_Recorridos  1234 non-null   int64
 5   Tipo_Combustible       1234 non-null   object
 6   Transmision            1234 non-null   object
 7   Dueños                 1234 non-null   object
 8   Millas_Recorridas      1234 non-null   object
 9   Cilindraje             1224 non-null   object
 10  Potencia               1224 non-null   object
 11  Asientos               1223 non-null   float64
 12  Nuevo_Precio           182 non-null    object
dtypes: float64(1), int64(3), object(9)
memory usage: 125.5+ KB

In [7]:
datos["Dueños"].unique()

array(['First', 'Second', 'Third', 'Fourth & Above'], dtype=object)

In [5]:
datos.describe()

                ID          Año  Kilometros_Recorridos     Asientos
count  1234.000000  1234.000000            1234.000000  1223.000000
mean    616.500000  2013.400324           58507.288493     5.284546
std     356.369424     3.179700           35598.702098     0.825622
min       0.000000  1996.000000            1000.000000     2.000000
25%     308.250000  2011.000000           34000.000000     5.000000
50%     616.500000  2014.000000           54572.500000     5.000000
75%     924.750000  2016.000000           75000.000000     5.000000
max    1233.000000  2019.000000          350000.000000    10.000000

In [6]:
# Guardar le progreso de los cambios en un nuevo archivo cambiae el nombre Automoviles.csv

path ="Datos/Automoviles.csv"

datos.to_csv(path)

In [8]:
datos["Modelo"].value_counts()

Modelo
Maruti Alto LXi                                         9
Volkswagen Polo 1.2 MPI Highline                        8
Maruti Swift Dzire VDI                                  8
Honda City 1.5 V MT                                     8
Maruti Alto 800 2016-2019 LXI                           7
                                                       ..
Hyundai Verna 1.6 SX VTVT (O)                           1
Hyundai Elite i20 Magna Plus                            1
Honda Amaze VX AT i-Vtech                               1
Chevrolet Aveo 1.4 LS                                   1
Mercedes-Benz E-Class 2009-2013 E 220 CDI Avantgarde    1
Name: count, Length: 768, dtype: int64

In [14]:
datos["Nuevo_Precio"]

0              NaN
1              NaN
2       25.27 Lakh
3              NaN
4              NaN
           ...
1229           NaN
1230           NaN
1231           NaN
1232           NaN
1233           NaN
Name: Nuevo_Precio, Length: 1234, dtype: object